pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/0/Theta.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      Theta.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
131072
(
0.0029046053
0.0033510346
0.0034400339
0.0029566188
0.0024352166
0.0024342742
0.002707176
0.0029508765
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
    magLens_top_master
    {
        type            cyclic;
    }
    magLens_top_slave
    {
        type            cyclic;
    }
    magLens_bottom_master
    {
        type            cyclic;
    }
    magLens_bottom_slave
    {
        type            cyclic;
    }
}


// ************************************************************************* //
