pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/0/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
131072
(
0.97953125
0.97633502
0.9739509
0.96812439
0.96550022
0.96721345
0.96766127
0.97220036
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
    magLens_top_master
    {
        type            cyclic;
    }
    magLens_top_slave
    {
        type            cyclic;
    }
    magLens_bottom_master
    {
        type            cyclic;
    }
    magLens_bottom_slave
    {
        type            cyclic;
    }
}


// ************************************************************************* //
