pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/0/nut.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      nut.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
131072
(
2.7618461e-07
3.2281883e-07
3.4083031e-07
3.3081134e-07
2.9936158e-07
2.9346732e-07
3.1255537e-07
3.1340713e-07
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
    magLens_top_master
    {
        type            cyclic;
    }
    magLens_top_slave
    {
        type            cyclic;
    }
    magLens_bottom_master
    {
        type            cyclic;
    }
    magLens_bottom_slave
    {
        type            cyclic;
    }
}


// ************************************************************************* //
