pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// sub-models & settings

syncMode false;

modelType "A";

couplingInterval 50;

voidFractionModel centre;

locateModel engine;

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel off;

cartesianOutput;

probeModel off;

dataExchangeModel twoWayMPI;

averagingModel dense;

clockModel off;

smoothingModel laplaceFilterSmoothing;

forceModels
(
    BeetstraDrag
    gradPForce
    viscForce
    staticPressure
    particleVelocityController
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "turbulenceProperties";

transferDataModels
(
     transferFaceData
     transferCellData
);


// sub-model properties

implicitCoupleProps
{
    velFieldName "U.air";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}


gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U.air";
    interpolation true;
    treatForceDem true;
}

viscForceProps
{
    velocityFieldName "U.air";
    interpolation true;
    treatForceDem true;
}

BeetstraDragProps
{
    velFieldName "U.air";
    granVelFieldName "Us";
    rhoParticle 1500.;
    voidfractionFieldName "voidfraction";
    interpolation true;
    implForceDEM  true;
}

staticPressureProps
{
       rhoGas 1.3;
       voidfractionFieldName "voidfraction";
       rhoPart 1500;
       DomainSolidVolumeFraction 0.05;
       g_DEM (0 0 -9.81);
       interpolation true;
       treatForceDem true;
}

particleVelocityControllerProps
{
  controllerCellSetNames ( topControllerCellSet 
  		            bottomControllerCellSet      				
       	          );
   controllVelocity true;
   rhoPart 1500;
   interpolation true;
   controllerErrorSwitch false;
   treatForceDem true;
}


transferFaceDataProps
{

  magnificationLensPatchIDArrayNames ( patchFaceGlobalIDs_magLens_top_slave 
  				        patchFaceGlobalIDs_magLens_bottom_master      				
       			     );
       			    
  magnificationLensBoundaryPatchNames ( magLens_top_slave
        				 magLens_bottom_master     				      
        			      );


}

transferCellDataProps
{
    magnificationLensBoundaryPatchNames ( magLens_top_master
    					   magLens_bottom_slave 
    					 );

}

engineProps
{
    treeSearch true;
}


laplaceFilterSmoothingProps
{
    upperLimit                          1.0e4;
    lowerLimit                          1.0e-4;
    iterations                          1;
    widthCoeff                          24.0;
    verbose                             false;
}

centreProps
{
    alphaMin 0.01;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

// ************************************************************************* //
