pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (particles air);

particles
{
    diameterModel constant;
    constantCoeffs
    {
        d               7.5e-5;
    }

    alphaMax 0.65;
    residualAlpha 1.e-4;
}

air
{
    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }
    residualAlpha   0;
}


blending
{
    default
    {
        type            none;
        continuousPhase air;
    }
}

sigma
(
    (particles and air) 0
);

aspectRatio
(
);

drag
(
    (particles in air)
    {
        type            Beetstra;
        residualAlpha   1e-6;
        residualRe      1e-2;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
);

heatTransfer
(
    (particles in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
);

driftTemperature
(

);


lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);


driftVelocity
(
);


//meso-scale interphase Force
interPhaseForce
(

);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
