pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/constant/turbulenceProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

RAS
{
    RASModel SATFMcontinuous;

    turbulence      on;
    printCoeffs     on;
    
    SATFMcontinuousCoeffs
    {
        equilibrium             off;  // equilibrium assumption: production of k == dissipation
        dynamicAdjustment       on;  // dynamic adjustment of model coefficient and correlation coefficients
	    anIsoTropicNut          on;  // anisotropic treatment of shear component of Reynolds-stress tensor        
        
        alphaMax                0.65;
        residualAlpha           1e-4; // minimum dispersed phase volume fraction
        
        xiPhiG                  0.5; // correlation coefficient between dispersed phase volume fraction and continuous phase velocity
        Cmu                     0.3; // smagorinsky constant for turbulent viscosity   
        Ceps                    0.6; // constant for mixing length model of turbulent dissipation rate
        Cp                      1.0;
        Sigma                   0.5; // turbulent schmidt number
        CphiG                   1.0;
        g                       (0 0 -9.81);

        maxK                    30.0; // Limits Reynolds stresses
        
	filter                  laplaceAnIso2nd; // test filter for dynamic adjustment of model constants    
	laplaceAnIso2ndCoeffs   
	{
		widthCoeff		7.0;
	}
		
    }
    ADMcontinuousCoeffs
    {
        alphaMax                0.6;  // maximum dispersed phase volume fraction
        residualAlpha           1e-3; // minimum dispersed phase volume fraction for dispersed phase Reynolds stress
        maxK                    0.04; // Limits Reynolds stresses
        deconOrder              2;    // deconvolution Order

		filter                  laplaceAnIso2nd; // filter for ADM    
		laplaceAnIso2ndCoeffs   
		{
			widthCoeff		24.0;
		}
		
        regularizationModel     none;  // regularization model (e.g. Stolz)
        StolzCoeffs
        {
        	smagConst       0.25;
        	lengthConst     0.3;	
        	filter          laplaceAnIso2nd; // filter for Stolz    
        	laplaceAnIso2ndCoeffs   
        	{
        		widthCoeff		24.0;
        	}
        }
    }
}


// ************************************************************************* //
