pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/constant/turbulenceProperties.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel kineticTheory;

    turbulence      on;
    printCoeffs     on;
    kineticTheoryCoeffs
    {
        equilibrium             off;
        e                       0.9;
        alphaMax                0.65;
        alphaMinFriction        0.6;
        residualAlpha           1e-6;

        viscosityModel          SchneiderbauerEtAl; 
        conductivityModel       HrenyaSinclair;
        granularPressureModel   Lun; 
        frictionalStressModel   ChialvoEtAl;
        radialModel             Arastoopour;
        
        KochSanganiDrag        off;
        
        ChialvoEtAlCoeffs
        {
            alpha            1.6;
            L                0.145;
            b                0.2;
            muSt             0.3268;
            muC              0.697;
            I0               0.32;
            aQSk             0.105; 
            aInt             0.1;
            k                1.0e3;
            alphaDeltaMin    0.01;
            Rc               0.0; 
        }	       
        SchneiderbauerEtAlCoeffs
        {
            alpha            1.6;
            L                0.145;
            b                0.2;
            muSt             0.3268;
            muC              0.697;
            I0               0.32;
            aQSk             0.105;
            k                1.0e3;
            alphaDeltaMin    0.01;
            Rc               0.0; 
        }		
        SchaefferCoeffs
        {
            phi                     28;
        }
        
        HrenyaSinclairCoeffs
        {
            L   0.008;
        
        }	
    }


    phasePressureCoeffs
    {
        preAlphaExp     500;
        expMax          1000;
        alphaMax        0.62;
        g0              1000;
    }
}


// ************************************************************************* //
