pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p05/CFD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.9414
    volScalarFieldValue alpha.particles 0.0586
);

regions
(
/*
    boxToCell 
    {
        box ( -1 -1 -1) ( 0.0 0.0 0.0 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.925
            volScalarFieldValue alpha.particles 0.075
        );
    }
    boxToCell
    {
        box ( 0 0 0 ) ( 1 1 1 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.975
            volScalarFieldValue alpha.particles 0.025
        );
    }
*/ 
    boxToCell
    {
        box ( -0.004 -0.004 -0.016 ) ( 0 0 -0.003 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.925
            volScalarFieldValue alpha.particles 0.075
        );
    }  
    boxToCell
    {
        box ( 0 0 0.003) ( 0.004 0.004 0.016);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.925
            volScalarFieldValue alpha.particles 0.075
        );
    }      
);


// ************************************************************************* //
